import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  try {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;

  const date = d.toLocaleDateString(locale, {day: 'numeric', month: 'long', year: 'numeric'});
  const {money, joincount} = global.db.data.users[m.sender];
  const {exp, limit, level, role} = global.db.data.users[m.sender];

  const pp = await conn.profilePictureUrl(conn.user.jid).catch(_ => 'https://telegra.ph/file/24fa902ead26340f3df2c.png');
  const fkon = { key: { fromMe: false, participant: `0@s.whatsapp.net`, ...(m.chat ? { remoteJid: `status@broadcast` } : {}) }, message: { 'contactMessage': { 'displayName': wm, 'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:XL;${wm},;;;\nFN:${wm},\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabell:Ponsel\nEND:VCARD`, 'jpegThumbnail': imagen1, thumbnail: imagen1 ,sendEphemeral: true}}};
  //await conn.reply(m.chat, '𝙀𝙣 𝙗𝙧𝙚𝙫𝙚 𝙨𝙚 𝙚𝙣𝙫𝙞𝙖𝙧𝙖 𝙚𝙡 𝙢𝙚𝙣𝙪. . .',m, { contextInfo:{ forwardingScore: 2022, isForwarded: true, externalAdReply: {title: '👋 ᕼOᒪᗩ!!', body: 'sɪɢᴜᴇᴍᴇ ᴇɴ ɪɴsᴛᴀɢʀᴀᴍ', sourceUrl: global.md, thumbnail: await (await fetch(pp)).buffer() }}})

m.react('🌻');
  let txt =`> Bᴜᴇɴᴏs Dɪᴀs ✨ @⁨Oғᴄ.Dɪᴇɢᴏ⁩

┌–––––––––––––––––ɪ✥
│『 *INFO USER 🍒* 』
└┬❖
┌┤
┊│ 🌸 𝐂𝐥𝐢𝐞𝐧𝐭𝐞: 【ᵁᶰᵏ】៚ęꪶꫀꪜⅈ ᴳᵒᵈ᭄ ..OFC
┊│ 🧃 𝐄𝐱𝐩: 1167
┊│ 💎 𝐃𝐢𝐚𝐦𝐚𝐧𝐭𝐞𝐬: 30
┊│ 🍓 𝐍𝐢𝐯𝐞𝐥: 2
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥

┌–––––––––––––––––ɪ✥
│『 *INFO BOT 🌸* 』
└┬❖
┌┤
┊│ 🍬 𝐏𝐫𝐨𝐩𝐢𝐞𝐭𝐚𝐫𝐢𝐨: Dɪᴇɢᴏ.Oғᴄ
┊│ 🍒 𝐑𝐮𝐧𝐭𝐢𝐦𝐞: 02:24:00
┊│ 🍍 𝐔𝐬𝐮𝐚𝐫𝐢𝐨𝐬: 652
┊│ 🫐 𝐕𝐞𝐫𝐬𝐢𝐨𝐧: 1.0.7
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
         *乂 ⺀ ʟɪꜱᴛᴀ - ᴄᴏᴍᴀɴᴅᴏꜱ ⺀ 乂*

┌–––––––––––––––––ɪ✥
│『 *INFO ⚙️* 』
└┬❖
┌┤
┊│ 🌸 .afk [alasan]
┊│ 🌸 .allmenu
┊│ 🌸 .formarpareja
┊│ 🌸 .estado
┊│ 🌸 .blocklist
┊│ 🌸 .ping
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *BUSQUEDAS 🔍* 』
└┬❖
┌┤
┊│ 🌸 .playlist *<texto>*
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *SER JADIBOTS 🤖* 』
└┬❖
┌┤
┊│ 🌸 .deletebot
┊│ 🌸 .stop
┊│ 🌸 .byebot
┊│ 🌸 .bots
┊│ 🌸 .jadibot
┊│ 🌸 .serbot
┊│ 🌸 .getcode
┊│ 🌸 .rentbot
┊│ 🌸 .token
┊│ 🌸 .gettoken
┊│ 🌸 .serbottoken
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *ECONOMIA 🪙* 』
└┬❖
┌┤
┊│ 🌸 .adventure
┊│ 🌸 .berburu
┊│ 🌸 .heal
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *REGISTRO 📇* 』
└┬❖
┌┤
┊│ 🌸 .daily
┊│ 🌸 .claim
┊│ 🌸 .minar
┊│ 🌸 .myns
┊│ 🌸 .profile
┊│ 🌸 .reg
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *STICKER ✨️* 』
└┬❖
┌┤
┊│ 🌸 .emoji <tipo> <emoji>
┊│ 🌸 .stiker (caption|reply media)
┊│ 🌸 .stiker <url>
┊│ 🌸 .stikergif (caption|reply media)
┊│ 🌸 .stikergif <url>
┊│ 🌸 .ttp
┊│ 🌸 .ttp2
┊│ 🌸 .ttp3
┊│ 🌸 .ttp4
┊│ 🌸 .ttp5
┊│ 🌸 .attp
┊│ 🌸 .attp2
┊│ 🌸 .attp3
┊│ 🌸 .wm <packname>|<author>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *EXP 🏷* 』
└┬❖
┌┤
┊│ 🌸 .robar
┊│ 🌸 .bal
┊│ 🌸 .daily
┊│ 🌸 .top
┊│ 🌸 .levelup
┊│ 🌸 .Buy
┊│ 🌸 .Buyall
┊│ 🌸 .transfer [tipo] [cantidad] [@tag]
┊│ 🌸 .unreg <numero de serie>
┊│ 🌸 .unregister <numero de serie>
┊│ 🌸 .work
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *CALCULATOR 💻* 』
└┬❖
┌┤
┊│ 🌸 .gay2 @tag | nombre
┊│ 🌸 .lesbiana @tag | nombre
┊│ 🌸 .pajero @tag | nombre
┊│ 🌸 .pajera @tag | nombre
┊│ 🌸 .puto @tag | nombre
┊│ 🌸 .puta @tag | nombre
┊│ 🌸 .manco @tag | nombre
┊│ 🌸 .manca @tag | nombre
┊│ 🌸 .rata @tag | nombre
┊│ 🌸 .prostituta @tag | nombre
┊│ 🌸 .prostituto @tag | nombre
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *FIX 🔮* 』
└┬❖
┌┤
┊│ 🌸 .fixmsgespera
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *GRUPOS 🌩* 』
└┬❖
┌┤
┊│ 🌸 .enable <option>
┊│ 🌸 .disable <option>
┊│ 🌸 .add número
┊│ 🌸 .+ número
┊│ 🌸 admins <texto>
┊│ 🌸 .group open / close
┊│ 🌸 .grupo abrir / cerrar
┊│ 🌸 .grouptime *<open/close>* *<número>*
┊│ 🌸 .del
┊│ 🌸 .delete
┊│ 🌸 .infogrup
┊│ 🌸 .kick
┊│ 🌸 .setbye <text>
┊│ 🌸 .Setdesc <text>
┊│ 🌸 .setname <text>
┊│ 🌸 .setppgrup
┊│ 🌸 .setwelcome <text>
┊│ 🌸 .tagall <mesaje>
┊│ 🌸 .invocar <mesaje>
┊│ 🌸 .encuesta question|option|option
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *GRUPOS 🌩* 』
└┬❖
┌┤
┊│ 🌸 .demote
┊│ 🌸 .hidetag
┊│ 🌸 .link
┊│ 🌸 .promote
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *BUSCADORES 🔍* 』
└┬❖
┌┤
┊│ 🌸 .githubs
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *DATABASE 📚* 』
└┬❖
┌┤
┊│ 🌸 .addvn <text>
┊│ 🌸 .addmsg <text>
┊│ 🌸 .addvideo <text>
┊│ 🌸 .addaudio <text>
┊│ 🌸 .addimg <text>
┊│ 🌸 .addsticker <text>
┊│ 🌸 .delvn <text>
┊│ 🌸 .delmsg <text>
┊│ 🌸 .delvideo <text>
┊│ 🌸 .delaudio <text>
┊│ 🌸 .delimg <text>
┊│ 🌸 .delsticker <text>
┊│ 🌸 .getvn <text>
┊│ 🌸 .getmsg <text>
┊│ 🌸 .getvideo <text>
┊│ 🌸 .getaudio <text>
┊│ 🌸 .getimg <text>
┊│ 🌸 .getsticker <text>
┊│ 🌸 .listvn
┊│ 🌸 .listmsg
┊│ 🌸 .listvideo
┊│ 🌸 .listaudio
┊│ 🌸 .listimg
┊│ 🌸 .liststicker
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *INTERNET 📮* 』
└┬❖
┌┤
┊│ 🌸 .google <pencarian>
┊│ 🌸 .googlef <pencarian>
┊│ 🌸 .lirik <Apa>
┊│ 🌸 .letra <Apa>
┊│ 🌸 .playstore <aplicacion>
┊│ 🌸 .wikipedia <apa>
┊│ 🌸 .ytsearch
┊│ 🌸 .igstalk <username>
┊│ 🌸 .gimage <query>
┊│ 🌸 .imagen <query>
┊│ 🌸 .pinterest
┊│ 🌸 .ss <url>
┊│ 🌸 .ssf <url>
┊│ 🌸 .fetch <url>
┊│ 🌸 .get <url>
┊│ 🌸 .cristianoronaldo
┊│ 🌸 .cr7
┊│ 🌸 .messi
┊│ 🌸 .blackpink
┊│ 🌸 .itzy
┊│ 🌸 .kpopitzy
┊│ 🌸 .navidad
┊│ 🌸 .ppcouple
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *STALK 📒* 』
└┬❖
┌┤
┊│ 🌸 .tiktokstalk <username>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *PREMIUM 👑* 』
└┬❖
┌┤
┊│ 🌸 .xnxxsearch <query>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *FRASES ✏️* 』
└┬❖
┌┤
┊│ 🌸 .consejo
┊│ 🌸 .fraseromantica
┊│ 🌸 .historiaromantica
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *DESCARGAS 📥* 』
└┬❖
┌┤
┊│ 🌸 .xnxxsearch <query>
┊│ 🌸 .gitclone <url>
┊│ 🌸 .igstory <username>
┊│ 🌸 .mediafire <url>
┊│ 🌸 .play.1 <texto>
┊│ 🌸 .play.2 <texto>
┊│ 🌸 .tiktokfoto <username>
┊│ 🌸 .wallpaper <query>
┊│ 🌸 .wallpaper2 <query>
┊│ 🌸 .ytmetadata < url >
┊│ 🌸 .ytest < url >
┊│ 🌸 .ytd
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *DESCARGAS 📥* 』
└┬❖
┌┤
┊│ 🌸 .fb
┊│ 🌸 .ig
┊│ 🌸 .apkmod
┊│ 🌸 .play
┊│ 🌸 .play2
┊│ 🌸 .play3
┊│ 🌸 .play4
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *HERRAMIENTAS 🧰* 』
└┬❖
┌┤
┊│ 🌸 .toanime
┊│ 🌸 .tts <lang> <teks>
┊│ 🌸 .gimage <query>
┊│ 🌸 .imagen <query>
┊│ 🌸 .tinyurl <link>
┊│ 🌸 .acortar <link>
┊│ 🌸 .tamaño <cantidad>
┊│ 🌸 .calc <expression>
┊│ 🌸 .clima *<ciudad/país>*
┊│ 🌸 .dropmail
┊│ 🌸 .fake <text> @user <text2>
┊│ 🌸 .remini
┊│ 🌸 .hd
┊│ 🌸 .enhance
┊│ 🌸 .qr <teks>
┊│ 🌸 .qrcode <teks>
┊│ 🌸 .readmore <teks>|<teks>
┊│ 🌸 .spoiler <teks>|<teks>
┊│ 🌸 .readvo
┊│ 🌸 .style <text>
┊│ 🌸 .ping
┊│ 🌸 .ytcomment <comment>
┊│ 🌸 .saveimage <nome>
┊│ 🌸 .viewimage <nome>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *HERRAMIENTAS 🧰* 』
└┬❖
┌┤
┊│ 🌸 .bard
┊│ 🌸 .gemini
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *DIVERSIONES ☁️* 』
└┬❖
┌┤
┊│ 🌸 .ahorcado
┊│ 🌸 .doxear <nombre> | <@tag>
┊│ 🌸 .formarpareja
┊│ 🌸 .love
┊│ 🌸 .personalidad *<nombre>*
┊│ 🌸 .pregunta
┊│ 🌸 .reto
┊│ 🌸 .suerte
┊│ 🌸 .ruleta
┊│ 🌸 .ruletas
┊│ 🌸 .simi
┊│ 🌸 .sorteo
┊│ 🌸 .top
┊│ 🌸 .topgays
┊│ 🌸 .topotakus
┊│ 🌸 .verdad
┊│ 🌸 .acertijo
┊│ 🌸 .tebaklagu
┊│ 🌸 .pajeame
┊│ 🌸 .math <mode>
┊│ 🌸 .ppt
┊│ 🌸 .slot <apuesta>
┊│ 🌸 .gay
┊│ 🌸 .hornycard
┊│ 🌸 .hornylicense
┊│ 🌸 .emojimix emot1|emot2>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *NSFW 🔞* 』
└┬❖
┌┤
┊│ 🌸 .nsfwloli
┊│ 🌸 .nsfwfoot
┊│ 🌸 .nsfwass
┊│ 🌸 .nsfwbdsm
┊│ 🌸 .nsfwcum
┊│ 🌸 .nsfwero
┊│ 🌸 .nsfwfemdom
┊│ 🌸 .nsfwfoot
┊│ 🌸 .nsfwglass
┊│ 🌸 .nsfworgy
┊│ 🌸 .yuri
┊│ 🌸 .yuri2
┊│ 🌸 .yaoi
┊│ 🌸 .yaoi2
┊│ 🌸 .panties
┊│ 🌸 .tetas
┊│ 🌸 .booty
┊│ 🌸 .ecchi
┊│ 🌸 .furro
┊│ 🌸 .hentai
┊│ 🌸 .trapito
┊│ 🌸 .imagenlesbians
┊│ 🌸 .pene
┊│ 🌸 .porno
┊│ 🌸 .randomxxx
┊│ 🌸 .pechos
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *IMAGE 🚩* 』
└┬❖
┌┤
┊│ 🌸 .kpop <query>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *RANDOM ☄️* 』
└┬❖
┌┤
┊│ 🌸 .cat
┊│ 🌸 .dog
┊│ 🌸 .lolivid
┊│ 🌸 .meme
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *ANIMES 🌸* 』
└┬❖
┌┤
┊│ 🌸 .akira
┊│ 🌸 .akiyama
┊│ 🌸 .anna
┊│ 🌸 .asuna
┊│ 🌸 .ayuzawa
┊│ 🌸 .boruto
┊│ 🌸 .chiho
┊│ 🌸 .chitoge
┊│ 🌸 .deidara
┊│ 🌸 .erza
┊│ 🌸 .elaina
┊│ 🌸 .eba
┊│ 🌸 .emilia
┊│ 🌸 .hestia
┊│ 🌸 .hinata
┊│ 🌸 .inori
┊│ 🌸 .isuzu
┊│ 🌸 .itachi
┊│ 🌸 .itori
┊│ 🌸 .kaga
┊│ 🌸 .kagura
┊│ 🌸 .kaori
┊│ 🌸 .keneki
┊│ 🌸 .kotori
┊│ 🌸 .kurumi
┊│ 🌸 .madara
┊│ 🌸 .mikasa
┊│ 🌸 .miku
┊│ 🌸 .minato
┊│ 🌸 .naruto
┊│ 🌸 .nezuko
┊│ 🌸 .sagiri
┊│ 🌸 .sasuke
┊│ 🌸 .sakura
┊│ 🌸 .cosplay
┊│ 🌸 .loli
┊│ 🌸 .neko
┊│ 🌸 .waifu
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *CREADOR 👑* 』
└┬❖
┌┤
┊│ 🌸 .creargc *<nombre>*
┊│ 🌸 .enable <option>
┊│ 🌸 .disable <option>
┊│ 🌸 .del_reg_in_session_owner
┊│ 🌸 .creador
┊│ 🌸 .owner
┊│ 🌸 .addprem [@user] <days>
┊│ 🌸 .banchat
┊│ 🌸 .broadcastgroup <teks>
┊│ 🌸 .bcgc <teks>
┊│ 🌸 .bcgc2
┊│ 🌸 .broadcast <teks>
┊│ 🌸 .bc <teks>
┊│ 🌸 .broadcastchats <teks>
┊│ 🌸 .bcchats <teks>
┊│ 🌸 .cheat
┊│ 🌸 .cleartmp
┊│ 🌸 .deleteplugin <nombre>
┊│ 🌸 .delprem <@user>
┊│ 🌸 >
┊│ 🌸 =>
┊│ 🌸 .getplugin *<nombre>*
┊│ 🌸 .resetprefix
┊│ 🌸 .restart
┊│ 🌸 .saveplugin
┊│ 🌸 .setbotname <teks>
┊│ 🌸 .setbotbio <teks>
┊│ 🌸 .setprefix [prefix]
┊│ 🌸 .unbanuser
┊│ 🌸 .update
┊│ 🌸 .actualizar
┊│ 🌸 .reunion
┊│ 🌸 .addprem [@user] <days>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *EFECTO AUDIOS 🍂* 』
└┬❖
┌┤
┊│ 🌸 .bass [vn]
┊│ 🌸 .blown [vn]
┊│ 🌸 .deep [vn]
┊│ 🌸 .earrape [vn]
┊│ 🌸 .fast [vn]
┊│ 🌸 .fat [vn]
┊│ 🌸 .nightcore [vn]
┊│ 🌸 .reverse [vn]
┊│ 🌸 .robot [vn]
┊│ 🌸 .slow [vn]
┊│ 🌸 .smooth [vn]
┊│ 🌸 .tupai [vn]
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *INFORAMACIÓN 🍭* 』
└┬❖
┌┤
┊│ 🌸 .ping
┊│ 🌸 .horario
┊│ 🌸 .infinity
┊│ 🌸 .host
┊│ 🌸 .hosting
┊│ 🌸 .infobot
┊│ 🌸 .premlist [angka]
┊│ 🌸 .scbot
┊│ 🌸 .speedtest
┊│ 🌸 .instalarbot
┊│ 🌸 .groups
┊│ 🌸 .grouplist
┊│ 🌸 .reporte <teks>
┊│ 🌸 .request <teks>
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *AI 🌹* 』
└┬❖
┌┤
┊│ 🌸 .openia
┊│ 🌸 .chatgpt
┊│ 🌸 .ia
┊│ 🌸 .remini
┊│ 🌸 .hd
┊│ 🌸 .enhance
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *ADMINISTRADOR 🎌* 』
└┬❖
┌┤
┊│ 🌸 .setppgrup
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *GENERAL 🔮* 』
└┬❖
┌┤
┊│ 🌸 .spamwa <number>|<mesage>|<no of messages>
┊│ 🌸 .slap
┊│ 🌸 .stickfilter (caption|reply media)
┊│ 🌸 .stickmaker (caption|reply media)
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *MAKER 🌳* 』
└┬❖
┌┤
┊│ 🌸 .blur
┊│ 🌸 .difuminar2
┊│ 🌸 .itssostupid
┊│ 🌸 .iss
┊│ 🌸 .stupid
┊│ 🌸 .pixel
┊│ 🌸 .difuminar
┊│ 🌸 .simpcard
┊│ 🌸 .lolice
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *CONVERTIDORES 🚩* 』
└┬❖
┌┤
┊│ 🌸 .toimg
┊│ 🌸 .tourl
┊│ 🌸 .tovideo
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *GATA 🐈* 』
└┬❖
┌┤
┊│ 🌸 .minar2
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥
┌–––––––––––––––––ɪ✥
│『 *ECON 🤠* 』
└┬❖
┌┤
┊│ 🌸 .rob
│└────────────┈ɪ ⳹
┗–––––––––––––––––ɪ✥`;
   await conn.sendMessage(m.chat, {text: txt.trim(), mentions: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), contextInfo: {forwardingScore: 9999999, isForwarded: true, mentionedJid: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), "externalAdReply": {"showAdAttribution": true, "containsAutoReply": true, "renderLargerThumbnail": true, "title": packname, "body": `🌟 Hola` + nombre, "containsAutoReply": true, "mediaType": 1, "thumbnail": imagen7, "mediaUrl": [gp1,canal].getRandom(), "sourceUrl": [gp1,canal].getRandom()}}}, {quoted: estilo});
 // m.react('🎮');
  } catch {
    conn.reply(m.chat, '*[❗𝐈𝐍𝐅𝐎❗] 𝙴𝙻 𝙼𝙴𝙽𝚄 𝚃𝙸𝙴𝙽𝙴 𝚄𝙽 𝙴𝚁𝚁𝙾𝚁 𝙿𝙾𝚁𝙵𝙰𝚅𝙾𝚁 𝚄𝚂𝙴 𝙴𝙻 .allmenu*', m);
  }
};
handler.command = /^(menu|cmd|help|comandos)$/i;
export default handler;

function ucapan() {
    const time = moment.tz('America/Los_Angeled').format('HH')
    let res = "Buenas noches 🌙"
    if (time >= 4) {
        res = "Buen día 🌄"
    }
    if (time > 10) {
        res = "Buenas tardes ☀️"
    }
    if (time >= 15) {
        res = "Buenas tardes 🌅"
    }
    if (time >= 18) {
        res = "Buenas noches 🌙"
    }
    return res
}